Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: They are also mutually exclusive; that is, only the most recent one will be in effect.
fr: Elles sont également mutuellement exclusives ; c'est-à-dire, seulement la plus récente s'applique.

source: They are most often used with functions and control flow statements such as If and Loop.
fr: Ils sont le plus souvent utilisés avec des fonctions et des structures de flux de contrôle comme If et Loop.

source: They are typically used to add explanation or disable parts of the code.
fr: Ils sont typiquement utilisés pour ajouter des explications ou désactiver des parties du code.

source: They can be called either by a function call within the script or by the program itself, such as if a function was passed to the Hotkey or SetTimer commands.
fr: Elles peuvent être appelées soit par un appel de fonction dans le script ou par le programme lui-même, comme si une fonction était passée à la commande Hotkey ou SetTimer.

source: They can be used to store text, numbers, data from functions and commands or even mathematical equations.
fr: Elles peuvent être utilisées pour stocker du texte, des nombres, des données de fonctions et de commandes ou même des équations mathématiques.

source: They group a section of code together so that AutoHotkey knows it's one big family and that it needs to stay together.
fr: Ils regroupent une section de code et indiquent à AutoHotkey qu'ils forment une seule grande famille et doivent rester ensemble.

source: They take one, two or three values as input and return a value as the result.
fr: Ils prennent une, deux ou trois valeurs en entrée et renvoient une valeur comme résultat.

source: They treat %var%, %var%000 and similar as expressions, whereas numeric parameters of other commands do not.
fr: Elles traitent %var%, %var%000 et similaire comme des expressions, au contraire des paramètres numériques d'autres commandes.

source: Things like GameGuard, Hackshield, PunkBuster and several others.
fr: Des choses comme GameGuard, Hackshield, PunkBuster et plusieurs autres.

source: This "appends" the values to the end of the array MyObject.
fr: Ceci "ajoute" les valeurs à la fin du tableau MonObjet.

source: This example script makes the 000 key into an equals key.
fr: Ce script d'exemple transforme la touche 000 en une touche égal.

source: This allows expressions like (x.y)[z]() to work without the need to escape the opening parenthesis.
fr: Ceci permet à des expressions comme (x.y)[z]() de fonctionner sans avoir à échapper la parenthèse ouvrante.

source: This allows the options mentioned above to be varied during the course of building a single line.
fr: Ceci permet aux options mentionnées plus haut de varier lors de la construction d'une ligne.

source: This allows the script to easily continue or break out of any number of nested loops without using Goto.
fr: Ceci permet à un script de Continue ou Break un nombre quelconque de boucles embôitées sans utiliser Goto.

source: This allows the script to properly resume operation when you un-pause it.
fr: Ceci permet au script de reprendre correctement ses opérations quand la pause est enlevée.

source: This allows you to use an expression as the key to get the value from your object.
fr: Ceci permet d'utiliser une expression pour la clé à utiliser pour récupérer une valeur dans l'objet.

source: This also prevents commas and percent signs from being explicitly and individually escaped.
fr: Ceci empêche aussi les virgules et les signes pourcentage d'être échappés explicitement et individuellement.

source: This and the next methods below remove the key and the value.
fr: Ceci et les méthodes suivantes ci-dessous enlèvent la clé et la valeur.

source: This assumes AutoHotkey has already been installed.
fr: Ceci suppose que AutoHotkey a déjà été installé.

source: This assumes there is such a driver for your particular keyboard or mouse and that you can live without the features provided by its custom driver and software.
fr: Cela suppose qu'il existe un tel pilote pour votre clavier ou souris et que vous pouvez vivre sans les fonctionnalités fournies par son pilote et son logiciel personnalisés.

source: This assumes there is such a driver for your particular mouse and that you can live without the features provided by your mouse's custom software.
fr: En supposant qu'il existe un tel pilote pour cette souris en particulier et que les fonctionnalités fournies par le logiciel personnalisé de la souris ne sont pas nécessaires ou utiles.

source: This avoids the need to escape each percent sign to make it literal.
fr: Ceci évite à devoir échapper chaque signe pourcentage pour en faire un caractère littéral.

source: This can be combined with /iLib to validate the script without running it.
fr: Ceci peut être combiné avec /iLib pour valider le script sans l'exécuter.

source: This can be difficult to avoid (at least until such time as the legacy assignment syntax is removed), but it may help to always use := where an assignment is intended.
fr: Ceci peut être difficile à éviter (du moins jusqu'à ce que la syntaxe dépassée (legacy) d'affectation soit supprimée), mais il peut aider de toujours utiliser := là où une affectation est voulue.

source: This can be done by applying this registry patch.
fr: Ceci peut être fait en appliquant ce patch de registre.

source: This can be fixed by deleting the following registry key:
fr: Ceci peut être rétabli en supprimant du registre la clé suivante :

source: This can improve a script's readability and maintainability.
fr: Ceci peut améliorer la lisibilté et la maintenabilité d'un script.

source: This command literally sends keystrokes, to simulate typing or pressing of keys.
fr: Cette commande envoie des appuis de touche, pour simuler la frappe d'un texte ou des frappes quelconques.

source: This command reads the value from OldStr (the InputVar) and stores the result in NewStr (the OutputVar).
fr: Cette commande lit la valeur de AncienneChaine (la VarEntree) et stocke le résultat dans NouvelleChaine (la VarSortie).

source: This context menu option provides a workaround for common UAC-related issues by allowing the script to automate administrative programs - without the script running as admin.
fr: Cette option de menu contextuel permet de contourner les problèmes courants liés au contrôle du compte de l'utilisateur (UAC) en autorisant le script à automatiser des programmes administrateurs - sans que le script soit exécute en tant qu'administrateur.

source: This creates an EXE file of the same base filename as the script, which appears after a short time in the same directory.
fr: Ceci créé un fichier EXE de même nom de fichier de base que le script, qui apparaît après un court instant dans le même dossier.

source: This document describes the language and also tries to point out common pitfalls.
fr: Ce document décrit le langage et essaie aussi d'indiquer les écueils courants.

source: This does not reduce the script's execution speed because such lines are merged in memory the moment the script launches.
fr: Ceci ne réduit pas la vitesse d'exécution du script puisque de telles lignes sont fusionnées dans la mémoire au moment où le script est lancé.

source: This doesn't remove the key, but it will make the value appear identical to an unset value.
fr: Ceci n'enlève pas la clé, mais la valeur apparaîtra indistincte d'une valeur non définie.

source: This file is contained in the "Compiler" subfolder where AutoHotkey was installed.
fr: Ce fichier est contenu dans le sous-dossier "Compiler" où AutoHotkey a été installé.

source: This has the same effect as #SingleInstance Off.
fr: Ceci a le même effet que #SingleInstance Off.

source: This is achieved by preprocessing, so is not part of the language as such.
fr: Ceci est réalisé par pré-traitement, et ne fait donc pas partie du langage proprement dit.

source: This is an expression assignment, due to the : before the =.
fr: Ceci est une affectation par expression, par la présence de : avant =.

source: This is because ^A presses Ctrl+Shift+A and ^a presses Ctrl+A.
fr: car ^A appuie sur Ctrl+Shift+A tandis que ^a appuie sur Ctrl+A.

source: This is because !A presses Alt+Shift+A and !a presses Alt+A.
fr: car !A appuie sur Alt+Shift+A tandis que !a appuie sur Alt+A.

source: This is because the chance of success is low and it may cause unwanted side-effects that are difficult to undo:
fr: En effet, les chances de succès sont faibles et peuvent entraîner des effets secondaires indésirables difficiles à annuler:

source: This is described on the remapping page.
fr: Ceci est décrit sur la page de réaffectation.

source: This is done simply by writing the pieces of the name and percent-enclosed variables in sequence, without any spaces.
fr: Ceci est faisable en écrivant simplement dans l'ordre les morceaux du nom et les variables entre signes pourcentage, sans aucun espace.

source: This is equivalent to the brace syntax, but wrapped in a function.
fr: Ceci est équivalent à la syntaxe accolade, mais utilise une fonction.

source: This is equivalent to the bracket syntax, but wrapped in a function.
fr: Ceci est équivalent à la syntaxe crochet, mais utilise une fonction.

source: This is how a lot of "pros" have learned.
fr: C'est comme ça que beaucoup de "pros" ont appris.

source: This is known as a continuation section.
fr: Ceci est appelé une section de continuation.

source: This is not recommended, and is not feasible on Windows 8 or later.
fr: Ceci n'est pas recommandé, et n'est pas faisable à partir de Windows 8.

source: This is often referred to as a quoted literal string, or just quoted string.
fr: Ceci est souvent désigné par chaîne littérale entre guillemets, ou juste chaîne entre guillemets.

source: This is often used to organise code into separate files, or to make use of script libraries written by other users.
fr: Ceci est ouvent utilisé pour organiser du code en différents fichiers séparés, ou pour utiliser des bibliothèques de script écrites par d'autres utilisateurs.

source: This is perfectly fine since the if-statement only had one line of code associated with it.
fr: C'est parfaitement normal puisque l'instruction if (si) n'avait qu'une seule ligne de code associée.

source: This is primarily used to allow the continuation section to be indented.
fr: Ceci est principalement utilisé pour permettre d'indenter dans une section de continuation.

source: This is referred to as the One True Brace (OTB) style.
fr: Ceci est référencé comme le style One True Brace (OTB).

source: This is similar to how the InsertAt method with multiple specified values works.
fr: Le fonctionnement est similaire à celui de la méthode InsertAt avec plusieurs valeurs.

source: This is the key that invokes the right-click context menu.
fr: C'est la touche qui appelle le menu contextuel du clic droit.

source: This is the simplest form for a variable, a legacy assignment.
fr: Ceci est la forme la plus simple pour une variable, une affectation dépassée.

source: This is used to access pseudo-arrays, described below.
fr: Ceci est utilisé pour accéder à des pseudo-tableaux, décrits ci-dessous.

source: This isn't the only way, but the most common.
fr: Ce n'est pas la seule manière, mais la plus répandue.

source: This language bears some similarities to several other scripting languages, but also has its own unique strengths and pitfalls.
fr: Ce langage comporte des similarités avec plusieurs autres langages de script, mais a aussi ses propres avantages et inconvénients.

source: This means that you need percent signs around a variable, such as %Var%, and that any text and numbers do not need to be in quotation marks, such as This is some text.
fr: Il faut donc utiliser des signes pourcentage autour d'une variable, comme %Var%, et tout texte ou nombre n'a pas besoin d'être entre guillemets, comme Ceci est du texte.

source: This method should be used to merge a large number of lines or when the lines are not suitable for Method #1.
fr: Cette méthode devrait être utilisée pour fusionner un grand nombre de lignes ou quand les lignes ne permettent pas d'utiliser la Méthode #1.

source: This might also help us and other AutoHotkey users, as the vendor may confirm it is a false positive and fix their product to play nice with AutoHotkey.
fr: Cela pourrait aussi aider tous les utilisateurs de AutoHotkey, puisque l'éditeur pourrait confirmer qu'il s'agit d'un faux positif et modifier son produit pour être sympa avec AutoHotkey.

source: This old car will be dangerous to drive.
fr: Cette vieille voiture est dangereuse à conduire.

source: This only lets you use literal strings for the keys.
fr: Ceci ne permet que d'utiliser des chaînes de caractères littérales en tant que clés.

source: This option can be enabled or disabled without reinstalling AutoHotkey by re-running AutoHotkey Setup from the Start menu.
fr: Cette option peut être activée ou désactivée sans réinstaller AutoHotkey en ré-exécutant l'installateur de AutoHotkey depuis le menu Démarrer.

source: This option is not needed in places where percent signs are already literal, such as auto-replace hotstrings.
fr: Cette option n'est pas nécessaire quand les signes pourcentages sont déjà des caractères littéraux, comme pour les hotstrings à remplacement automatique.

source: This page contains information about the currently used version, the authors, the license, and a quick overview of the documentation.
fr: Cette page contient des informations sur la version couramment utilisée, les auteurs, la licence, et un rapide aperçu de la documentation.

source: This page lists all mouse buttons, keyboard keys and joystick buttons which can be used for hotkeys and key-specific commands/functions.
fr: Cette page contient une liste de tous les boutons de la souris, les touches du clavier et les boutons du joystick qui peuvent être utilisés pour les hotkeys et les commandes / fonctions spécifiques aux touches.

source: This page lists questions and answers about language syntax, general troubleshooting, common tasks, hotkeys, hotstrings and remapping.
fr: Cette page liste des questions et réponses à propos de la syntaxe du langage, de dépannage général, de tâches courantes, et des hotkeys, hotstrings et réassignement de touches.

source: This portion executes automatically when the script starts.
fr: Cette partie s'exécute automatiquement au lancement du script.

source: This practice is optional; it is done in cases like this so that the comma will be seen as a parameter-delimiter rather than a literal comma.
fr: Faire ainsi est facultatif ; ceci est fait dans des cas similaires afin que la virgule soit vue comme un délimiteur de paramètre plutôt qu'une virgule littérale.

source: This probably doesn't exist on most keyboards.
fr: Cela n'existe probablement pas sur la plupart des claviers.

source: This process is called "Scripting".
fr: Ce processus est appelé "Scripting".

source: This rarely-used method also prevents certain types of hotkeys from requiring the keyboard hook.
fr: Cette méthode rarement utilisée empêche également certains types de hotkeys d'exiger le hook clavier.

source: This rarely-used option is necessary only for the commas between command parameters because in function calls, the type of comma does not matter.
fr: Cette option rarement utilisée n'est nécessaire que pour les virgules entre paramètres de commande puisque dans les appels de fonction, le type de virgule n'a pas d'importance.

source: This removes all keys from Index to Index + Length - 1 (inclusive).
fr: Ceci enlève toutes les clés de Index à Index + Longueur - 1 (inclusif).

source: This removes the highest integer key, and returns the value.
fr: Ceci enlève la plus grande clé entière, et renvoie la valeur.

source: This second variable can then be used to assign a value to the target variable indirectly, using a double reference.
fr: Cette deuxième variable peut ensuite être utilisée pour affecter indirectement une valeur à la variable cible, en utilisant une double référence.

source: This stuff (indentation) is very important!
fr: Ceci (l'indentation) est très important !

source: This syntax is usually used to retrieve an element of an array or associative array.
fr: Cette syntaxe est habituellement utilisée pour récupérer un élément dans un tableau ou dans un tableau associatif.

source: This table shows the default function of each key on most versions of Windows.
fr: Ce tableau montre la fonction par défaut de chaque touche sur la plupart des versions de Windows.

source: This top portion of the script is referred to as the auto-execute section, but it is really just a subroutine which is called after program startup.
fr: Cette portion en haut du script est appelée section d'auto-exécution, mais n'est qu'un sous-programme appelé après le démarrage du programme.

source: This top portion of the script is referred to as the auto-execute section.
fr: La partie en haut du script est appelée la section d'auto-exécution.

source: This will become your best friend.
fr: Ceci deviendra un meilleur ami.

source: This will let you start of by defining what is sometimes called an "associative array".
fr: Ceci définit ce qui est parfois appelé un "tableau associatif" (associative array).

source: This will open the Startup folder for the current user.
fr: Ceci ouvrira le menu Démarrage de l'utilisateur courant.

source: This will prevent many issues when you start having a lot of stuff in your scripts.
fr: Ceci empêche beaucoup de problèmes d'apparaître quand un script commence à contenir beaucoup de choses.

source: This will shift ALL higher integer keys up by the number of values which were inserted, even if there are gaps (for example, only keys 1 and 100 exist, and you insert a value at key 50, it will shift 100 up to 101).
fr: Ceci décalera TOUTES les clés plus grandes par le nombre de valeurs insérées, même s'il y a des trous (par exemple, seules existent les clés 1 et 100, et une valeur est inséré à la clé 50, 100 sera décalée à 101).

source: This will start you off with what is sometimes called an "indexed array".
fr: Ceci définit ce qui est parfois appelé un "tableau indexé" (indexed array).

source: This, for some reason crosses some people's minds.
fr: Cela, pour une raison quelconque, traverse l'esprit de certaines personnes.

source: Those are a bit advanced and are covered more in-depth here:
fr: Ces critères sont un peu avancés et sont abordés plus en détail ici :

source: Throughout the documentation, you will see these two symbols ([ and ]) surrounding code in the yellow syntax box at the top of almost all pages.
fr: A travers la documentation, ces deux symboles ([ et ]) peuvent être vus entourant du code dans la zone jaune de syntaxe en haut de presque toutes les pages.

source: Throughout this tutorial you will see a lot of text and a lot of code.
fr: Ce tutoriel comprend beaucoup de texte et beaucoup de code.

source: Thus, it's usually best to make any desired changes to the defaults at the top of scripts that contain hotkeys, hotstrings, timers, or custom menu items.
fr: Ainsi, il est en général mieux de faire tout changement souhaité des valeurs par défaut en haut des scripts qui contiennent des hotkeys, hotstrings, minuteries, ou des éléments de menu personnalisé.

source: To suspend, pause or reload another script, replace the last line above with one of these:
fr: Pour suspendre, mettre en pause ou recharger un autre script, remplacer la dernière ligne ci-dessus par l'une de celles-ci :

source: To achieve this, the installer does the following:
fr: A cette fin, l'installateur réalise les étapes suivantes :

source: To add new keys and values:
fr: Pour ajouter des nouvelles clés et valeurs :

source: To always perform a logical left click, use Click Left or Send {Click Left}.
fr: Pour toujours effectuer un clic gauche logiquement, utilisez Click Left ou Send {Click Left}.

source: To always perform a logical right click, use Click Right or Send {Click Right}.
fr: Pour toujours effectuer un clic droit logiquement, utilisez Click Right ou Send {Click Right}.

source: To assign a value to a variable, use the := assignment operator, as in MyVar := "Some text".
fr: Pour affecter une valeur à une variable, utiliser l'opérateur d'affectation :=, comme dans MaVar := "Du texte".

source: To avoid this, add the *c option or use FileOpen() instead.
fr: Pour éviter cela, ajoutez l'option *c ou utilisez plutôt FileOpen().

source: To avoid using a temporary file (especially if the output is large), consider using the Shell.Exec() method as shown in the examples for the Run command.
fr: Pour éviter d'utiliser un fichier temporaire (surtout si la sortie est conséquente), considérer l'utilisation de la méthode Shell.Exec() comme montré dans les exemples de la commande Run.

source: To configure a script to start automatically after the user logs in, the easiest way is to place a shortcut to the script file in the Startup folder.
fr: Pour rendre l'exécution d'un script automatique après la connexion d'un utilisateur, le plus simple est de placer un raccourci vers ce script dans le dossier Démarrage.

source: To define this key as a hotkey, follow this example:
fr: Pour définir cette touche en tant que raccourci clavier, suivez cet exemple:

source: To determine the amount of time between two dates or times, see EnvSub, which gives an example.
fr: Pour déterminer le temps entre deux dates ou temps, voir EnvSub, qui donne un exemple.

source: To directly add a key and value, just set a key that doesn't exist yet.
fr: Pour ajouter directement clé et valeur, il suffit de définir une clé qui n'existe pas encore.

source: To do this, include the following line near the top of the script:
fr: Pour ce faire, ajouter la ligne suivante vers le haut du script :

source: To do this, you will need to use either of these fancy commands with a # in-front of them:
fr: Pour ce faire, il faut utiliser une de ces commandes avec un # devant :

source: To enable interactive debugging, first launch a supported debugger client then launch the script with the /Debug command-line switch.
fr: Pour activer le débogage interactif, commencer par lancer un client débogueur pris en charge puis exécuter le script avec le commutateur de ligne de commande /Debug.

source: To have the final line in the section also ended by a join-string, include a blank line immediately above the section's closing parenthesis.
fr: Pour que la dernière ligne de la section soit également suivie de la chaîne de caractères indiquée à Join, inclure une ligne vide immédiatement au-dessus de la parenthèse fermante de la section.

source: To help determine the button numbers for your joystick, use this test script.
fr: Pour vous aider à déterminer les numéros de boutons de votre joystick, utilisez ce script de test.

source: To help you learn what ^ and other symbols mean, gaze upon this chart:
fr: Pour apprendre à quoi ^ et d'autres symboles correspondent, les regards se dirigent sur ce tableau :

source: To hold down or release a key, enclose the key name in curly brackets and then use the word UP or DOWN.
fr: Pour maintenir enfoncée ou relâcher une touche, mettre le nom de la touche entre accolades et utiliser le mot UP (haut) ou DOWN (bas).

source: To include a leading or trailing space or tab, use the built-in variables %A_Space% and %A_Tab% or a forced expression such as % " x ".
fr: Pour inclure un espace ou une tabulation en début ou fin de paramètre, utiliser les variables intégrées %A_Space% et %A_Tab% ou une expression forcée comme % " x ".
